StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_phy.c
void rtl8730a_phy_haldm_watchdog(PADAPTER adapter)
{
	BOOLEAN bFwCurrentInPSMode = _FALSE;
	u8 bFwPSAwake = _TRUE;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapter);
	u8 in_lps = _FALSE;
	PADAPTER current_lps_iface = NULL, iface = NULL;
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);
	u8 i = 0;

	if (!rtw_is_hw_init_completed(adapter)) {
		goto skip_dm;
	}

#ifdef CONFIG_LPS
	bFwCurrentInPSMode = adapter_to_pwrctl(adapter)->bFwCurrentInPSMode;
	rtw_hal_get_hwreg(adapter, HW_VAR_FWLPS_RF_ON, &bFwPSAwake);
#endif /* CONFIG_LPS */

#ifdef CONFIG_P2P_PS
	/*
	 * Fw is under p2p powersaving mode, driver should stop dynamic mechanism.
	 */
	if (adapter->wdinfo.p2p_ps_mode) {
		bFwPSAwake = _FALSE;
	}
#endif /* CONFIG_P2P_PS */

	if ((rtw_is_hw_init_completed(adapter))
	    && ((!bFwCurrentInPSMode) && bFwPSAwake)) {

		/* check rx fifo */
		check_rxfifo_full(adapter);
	}

#ifdef CONFIG_LPS
	if (pwrpriv->bLeisurePs && bFwCurrentInPSMode && pwrpriv->pwr_mode != PS_MODE_ACTIVE) {
		in_lps = _TRUE;

		for (i = 0; i < dvobj->iface_nums; i++) {
			iface = dvobj->padapters[i];
			if (pwrpriv->current_lps_hw_port_id == rtw_hal_get_port(iface)) {
				current_lps_iface = iface;
				rtw_lps_rfon_ctrl(current_lps_iface, rf_on);
				break;
			}
		}

		if (!current_lps_iface) {
			RTW_WARN("Can't find a adapter with LPS to enable RFON function !\n");
			goto skip_dm;
		}
	}
#endif

#ifdef CONFIG_BEAMFORMING
#ifdef RTW_BEAMFORMING_VERSION_2
	if (check_fwstate(&adapter->mlmepriv, WIFI_STATION_STATE) &&
	    check_fwstate(&adapter->mlmepriv, WIFI_ASOC_STATE)) {
		rtw_hal_beamforming_config_csirate(adapter);
	}
#endif
#endif

#ifdef CONFIG_DISABLE_ODM
	goto skip_dm;
#endif

	rtw_phydm_watchdog(adapter, in_lps);

skip_dm:

#ifdef CONFIG_LPS
	if (current_lps_iface) {
		rtw_lps_rfon_ctrl(current_lps_iface, rf_off);
	}
#endif
	/*
	 * Check GPIO to determine current RF on/off and Pbc status.
	 * Check Hardware Radio ON/OFF or not
	 */
#ifdef CONFIG_SUPPORT_HW_WPS_PBC
	dm_CheckPbcGPIO(adapter);
#else /* !CONFIG_SUPPORT_HW_WPS_PBC */
	return;
#endif /* !CONFIG_SUPPORT_HW_WPS_PBC */
}

static u32 phy_calculatebitshift(u32 mask)
{
	u32 i;


	for (i = 0; i <= 31; i++)
		if (mask & BIT(i)) {
			break;
		}

	return i;
}

u32 rtl8730a_read_bb_reg(PADAPTER adapter, u32 addr, u32 mask)
{
	u32 val = 0, val_org, shift;
	u32 ctrl = 0;

#if (DISABLE_BB_RF == 1)
	return 0;
#endif
	/* testchip need to acccess some regs indirectly, DD will modify default access in mpchip */
	if (addr >= 0x4000 && addr <= 0x4fff) {
		while (rtw_read32(adapter, 0x1e8) & (BIT(30) | BIT(31))) {
			rtw_udelay_os(1);
		}
		/* @0x1e8[14:2] for reg addr,0x1e8[18:15] for bytes ctrl,0x1e8[31:30] for write or read */
		addr &= 0x7fff;
		ctrl = addr;
		ctrl |= BIT(31);
		rtw_write32(adapter, 0x1e8, ctrl);
		val = rtw_read32(adapter, 0x1ec);
	} else {
		val_org = rtw_read32(adapter, addr);
		shift = phy_calculatebitshift(mask);
		val = (val_org & mask) >> shift;
	}

	return val;
}

void rtl8730a_write_bb_reg(PADAPTER adapter, u32 addr, u32 mask, u32 val)
{
	u32 val_org, shift;
	u32 ctrl = 0;


#if (DISABLE_BB_RF == 1)
	return;
#endif

	/* testchip need to acccess some regs indirectly, DD will modify default access in mpchip */
	if (addr >= 0x4000 && addr <= 0x4fff) {
		while (rtw_read32(adapter, 0x1e8) & (BIT(30) | BIT(31))) {
			rtw_udelay_os(1);
		}
		/* @0x1e8[14:2] for reg addr,0x1e8[18:15] for bytes ctrl,0x1e8[31:30] for write or read */
		addr &= 0x7fff;
		ctrl |= (addr | BIT(30));
		if (mask != 0xFFFFFFFF) { //if not "double word" write
			shift = phy_calculatebitshift(mask);
			val = val << ((shift - 15) * 8);
			ctrl |= mask;
		} else { // byte write
			ctrl |= 0x00078000;
		}

		rtw_write32(adapter, 0x1ec, val);
		rtw_write32(adapter, 0x1e8, ctrl);
	} else {
		if (mask != 0xFFFFFFFF) {
			/* not "double word" write */
			val_org = rtw_read32(adapter, addr);
			shift = phy_calculatebitshift(mask);
			val = ((val_org & (~mask)) | ((val << shift) & mask));
		}

		rtw_write32(adapter, addr, val);
	}
}

u32 rtl8730a_read_rf_reg(PADAPTER adapter, enum rf_path path, u32 addr, u32 mask)
{
	struct dm_struct *phydm = adapter_to_phydm(adapter);
	u32 val;

	val = config_phydm_read_rf_reg_8730a(phydm, path, addr, mask);
	if (!config_phydm_read_rf_check_8730a(val))
		RTW_INFO(FUNC_ADPT_FMT ": read RF reg path=%d addr=0x%x mask=0x%x FAIL!\n",
			 FUNC_ADPT_ARG(adapter), path, addr, mask);

	return val;
}

void rtl8730a_write_rf_reg(PADAPTER adapter, enum rf_path path, u32 addr, u32 mask, u32 val)
{
	struct dm_struct *phydm = adapter_to_phydm(adapter);
	u8 ret;

	ret = config_phydm_write_rf_reg_8730a(phydm, path, addr, mask, val);
	if (_FALSE == ret)
		RTW_INFO(FUNC_ADPT_FMT ": write RF reg path=%d addr=0x%x mask=0x%x val=0x%x FAIL!\n",
			 FUNC_ADPT_ARG(adapter), path, addr, mask, val);
}

static void set_tx_power_level_by_path(PADAPTER adapter, u8 channel, u8 path)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);
	u8 under_survey_ch = phy_check_under_survey_ch(adapter);
	u8 under_24g = (hal->current_band_type == BAND_ON_2_4G);

	if (under_24g) {
		phy_set_tx_power_index_by_rate_section(adapter, path, channel, CCK);
	}

	phy_set_tx_power_index_by_rate_section(adapter, path, channel, OFDM);

	if (!under_survey_ch) {
		phy_set_tx_power_index_by_rate_section(adapter, path, channel, HT_MCS0_MCS7);
	}
}

void rtl8730a_set_tx_power_level(PADAPTER adapter, u8 channel)
{
	HAL_DATA_TYPE *hal_data = GET_HAL_DATA(adapter);
	struct dm_struct *phydm = adapter_to_phydm(adapter);
	struct hal_spec_t *hal_spec = GET_HAL_SPEC(adapter);
	u8 path;

	for (path = RF_PATH_A; path < hal_spec->rf_reg_path_num; ++path) {
#ifdef CONFIG_TXPWR_PG_WITH_TSSI_OFFSET
		if (hal_data->txpwr_pg_mode == TXPWR_PG_WITH_TSSI_OFFSET) {
			_halrf_tssi_set_powerlevel_8730a(phydm, path);
		} else
#endif
		{
			/*
			* can't bypass unused path
			* because phydm need all path value to calculate min diff
			*/
			set_tx_power_level_by_path(adapter, channel, path);
		}
	}
}

void rtl8730a_set_txpwr_done(_adapter *adapter)
{
	HAL_DATA_TYPE *hal_data = GET_HAL_DATA(adapter);
	struct dm_struct *phydm = adapter_to_phydm(adapter);

	if (hal_data->txpwr_pg_mode == TXPWR_PG_WITH_PWR_IDX
#ifdef CONFIG_MP_INCLUDED
	    || rtw_mp_mode_check(adapter) == _TRUE
#endif
	   ) {
		config_phydm_set_txagc_to_hw_8730a(phydm);
	}
}

