StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_phy.c
static void _config_beamformer_su(PADAPTER adapter, struct beamformer_entry *bfer)
{
	/* Beamforming */
	u8 nc_index = 0, nr_index = 0;
	u8 grouping = 0, codebookinfo = 0, coefficientsize = 0;
	u32 addr_bfer_info, addr_csi_rpt;
	u32 csi_param;
	/* Misc */
	u8 i;


	RTW_INFO("%s: Config SU BFer entry HW setting\n", __FUNCTION__);

	if (bfer->su_reg_index == 0) {
		addr_bfer_info = REG_ASSOCIATED_BFMER0_INFO_8730A;
		addr_csi_rpt = REG_TX_CSI_RPT_PARAM_BW20_8730A;
	} else {
		addr_bfer_info = REG_ASSOCIATED_BFMER1_INFO_8730A;
		addr_csi_rpt = REG_TX_CSI_RPT_PARAM_BW20_8730A + 2;
	}

	/* Sounding protocol control */
	rtw_write8(adapter, REG_SND_PTCL_CTRL_8730A, 0xDB);

	/* MAC address/Partial AID of Beamformer */
	for (i = 0; i < ETH_ALEN; i++) {
		rtw_write8(adapter, addr_bfer_info + i, bfer->mac_addr[i]);
	}

	/* CSI report parameters of Beamformer */
	nc_index = _bf_get_nrx(adapter);
	/*
	 * 0x718[7] = 1 use Nsts
	 * 0x718[7] = 0 use reg setting
	 * As Bfee, we use Nsts, so nr_index don't care
	 */
	nr_index = bfer->NumofSoundingDim;
	grouping = 0;
	/* for ac = 1, for n = 3 */
	if (TEST_FLAG(bfer->cap, BEAMFORMER_CAP_VHT_SU)) {
		codebookinfo = 1;
	} else if (TEST_FLAG(bfer->cap, BEAMFORMER_CAP_HT_EXPLICIT)) {
		codebookinfo = 3;
	}
	coefficientsize = 3;
	csi_param = (u16)((coefficientsize << 10) | (codebookinfo << 8) | (grouping << 6) | (nr_index << 3) | (nc_index));
	rtw_write16(adapter, addr_csi_rpt, csi_param);
	RTW_INFO("%s: nc=%d nr=%d group=%d codebookinfo=%d coefficientsize=%d\n",
		 __FUNCTION__, nc_index, nr_index, grouping, codebookinfo, coefficientsize);
	RTW_INFO("%s: csi=0x%04x\n", __FUNCTION__, csi_param);

	/* ndp_rx_standby_timer */
	rtw_write8(adapter, REG_SND_PTCL_CTRL_8730A + 3, 0x70);
}

static void _config_beamformer_mu(PADAPTER adapter, struct beamformer_entry *bfer)
{
	/* General */
	PHAL_DATA_TYPE hal;
	/* Beamforming */
	struct beamforming_info *bf_info;
	u8 nc_index = 0, nr_index = 0;
	u8 grouping = 0, codebookinfo = 0, coefficientsize = 0;
	u32 csi_param;
	/* Misc */
	u8 i, val8;
	u16 val16;

	RTW_INFO("%s: Config MU BFer entry HW setting\n", __FUNCTION__);

	hal = GET_HAL_DATA(adapter);
	bf_info = GET_BEAMFORM_INFO(adapter);

	/* Reset GID table */
	for (i = 0; i < 8; i++) {
		bfer->gid_valid[i] = 0;
	}
	for (i = 0; i < 16; i++) {
		bfer->user_position[i] = 0;
	}

	/* CSI report parameters of Beamformer */
	nc_index = _bf_get_nrx(adapter);
	nr_index = 1; /* 0x718[7] = 1 use Nsts, 0x718[7] = 0 use reg setting. as Bfee, we use Nsts, so Nr_index don't care */
	grouping = 0; /* no grouping */
	codebookinfo = 1; /* 7 bit for psi, 9 bit for phi */
	coefficientsize = 0; /* This is nothing really matter */
	csi_param = (u16)((coefficientsize << 10) | (codebookinfo << 8) |
			  (grouping << 6) | (nr_index << 3) | (nc_index));

	RTW_INFO("%s: nc=%d nr=%d group=%d codebookinfo=%d coefficientsize=%d\n",
		 __func__, nc_index, nr_index, grouping, codebookinfo,
		 coefficientsize);
	RTW_INFO("%s: csi=0x%04x\n", __func__, csi_param);

	rtw_halmac_bf_add_mu_bfer(adapter_to_dvobj(adapter), bfer->p_aid,
				  csi_param, bfer->aid & 0xfff, HAL_CSI_SEG_4K,
				  bfer->mac_addr);

	bf_info->cur_csi_rpt_rate = HALMAC_OFDM6;
	rtw_halmac_bf_cfg_sounding(adapter_to_dvobj(adapter), HAL_BFEE,
				   bf_info->cur_csi_rpt_rate);

	/* Set 0x6A0[14] = 1 to accept action_no_ack */
	val8 = rtw_read8(adapter, REG_RXFLTMAP0_8730A + 1);
	val8 |= (BIT_MGTFLT14EN_8730A >> 8);
	rtw_write8(adapter, REG_RXFLTMAP0_8730A + 1, val8);

	/* Set 0x6A2[5:4] = 1 to NDPA and BF report poll */
	val8 = rtw_read8(adapter, REG_RXFLTMAP1_8730A);
	val8 |= BIT_CTRLFLT4EN_8730A | BIT_CTRLFLT5EN_8730A;
	rtw_write8(adapter, REG_RXFLTMAP1_8730A, val8);
}

static void _config_beamformee_su(PADAPTER adapter, struct beamformee_entry *bfee)
{
	/* General */
	struct mlme_priv *mlme;
	/* Beamforming */
	struct beamforming_info *info;
	u8 idx;
	u16 p_aid = 0;
	/* Misc */
	u8 val8;
	u16 val16;
	u32 val32;


	RTW_INFO("%s: Config SU BFee entry HW setting\n", __FUNCTION__);

	mlme = &adapter->mlmepriv;
	info = GET_BEAMFORM_INFO(adapter);
	idx = bfee->su_reg_index;

	if ((check_fwstate(mlme, WIFI_ADHOC_STATE) == _TRUE)
	    || (check_fwstate(mlme, WIFI_ADHOC_MASTER_STATE) == _TRUE)) {
		p_aid = bfee->mac_id;
	} else {
		p_aid = bfee->p_aid;
	}

	phydm_txbf_rfmode(GET_PDM_ODM(adapter), info->beamformee_su_cnt, info->beamformee_mu_cnt);

	/* P_AID of Beamformee & enable NDPA transmission & enable NDPA interrupt */
	val32 = rtw_read32(adapter, REG_TXBF_CTRL_8730A);
	if (idx == 0) {
		val32 = BIT_SET_TXBF0_AID_8730A(val32, p_aid);
		val32 &= ~(BIT_TXBF0_20M_8730A | BIT_TXBF0_40M_8730A | BIT_TXBF0_80M_160M_8730A);
	} else {
		val32 = BIT_SET_TXBF1_AID_8730A(val32, p_aid);
		val32 &= ~(BIT_TXBF1_20M_8730A | BIT_TXBF1_40M_8730A | BIT_TXBF1_80M_160M_8730A);
	}
	val32 |= BIT_EN_NDPA_INT_8730A | BIT_NDPA_PARA_8730A | BIT_ENABLE_NDPA_8730A;
	rtw_write32(adapter, REG_TXBF_CTRL_8730A, val32);

	/* CSI report parameters of Beamformee */
	val32 = rtw_read32(adapter, REG_ASSOCIATED_BFMEE_SEL_8730A);
	if (idx == 0) {
		val32 = BIT_SET_AID0_8730A(val32, p_aid);
		val32 |= BIT_TXUSER_ID0_8730A;

		/* unknown? */
		val32 &= 0x03FFFFFF;
		val32 |= 0x60000000;
	} else {
		val32 = BIT_SET_AID1_8730A(val32, p_aid);
		val32 |= BIT_TXUSER_ID1_8730A;

		/* unknown? */
		val32 &= 0x03FFFFFF;
		val32 |= 0xE0000000;
	}
	rtw_write32(adapter, REG_ASSOCIATED_BFMEE_SEL_8730A, val32);
}

static void _config_beamformee_mu(PADAPTER adapter, struct beamformee_entry *bfee)
{
	/* General */
	PHAL_DATA_TYPE hal;
	/* Beamforming */
	struct beamforming_info *info;
	u8 idx;
	u32 gid_valid = 0, user_position_l = 0, user_position_h = 0;
	u32 mu_reg[6] = {REG_WMAC_ASSOCIATED_MU_BFMEE2_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE3_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE4_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE5_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE6_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE7_8730A
			};
	/* Misc */
	u8 i, val8;
	u16 val16;
	u32 val32;


	RTW_INFO("%s: Config MU BFee entry HW setting\n", __FUNCTION__);

