StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_phy.c
	hal = GET_HAL_DATA(adapter);
	info = GET_BEAMFORM_INFO(adapter);
	idx = bfee->mu_reg_index;

	/* User position table */
	switch (idx) {
	case 0:
		gid_valid = 0x7fe;
		user_position_l = 0x111110;
		user_position_h = 0x0;
		break;
	case 1:
		gid_valid = 0x7f806;
		user_position_l = 0x11000004;
		user_position_h = 0x11;
		break;
	case 2:
		gid_valid = 0x1f81818;
		user_position_l = 0x400040;
		user_position_h = 0x11100;
		break;
	case 3:
		gid_valid = 0x1e186060;
		user_position_l = 0x4000400;
		user_position_h = 0x1100040;
		break;
	case 4:
		gid_valid = 0x66618180;
		user_position_l = 0x40004000;
		user_position_h = 0x10040400;
		break;
	case 5:
		gid_valid = 0x79860600;
		user_position_l = 0x40000;
		user_position_h = 0x4404004;
		break;
	}

	for (i = 0; i < 8; i++) {
		if (i < 4) {
			bfee->gid_valid[i] = (u8)(gid_valid & 0xFF);
			gid_valid >>= 8;
		} else {
			bfee->gid_valid[i] = 0;
		}
	}
	for (i = 0; i < 16; i++) {
		if (i < 4) {
			bfee->user_position[i] = (u8)((user_position_l >> (i * 8)) & 0xFF);
		} else if (i < 8) {
			bfee->user_position[i] = (u8)((user_position_h >> ((i - 4) * 8)) & 0xFF);
		} else {
			bfee->user_position[i] = 0;
		}
	}

	/* Sounding protocol control */
	rtw_write8(adapter, REG_SND_PTCL_CTRL_8730A, 0xDB);

	/* select MU STA table */
	val32 = rtw_read32(adapter, REG_MU_TX_CTRL_8730A);
	val32 = BIT_SET_MU_TAB_SEL_8730A(val32, idx);
	rtw_write32(adapter, REG_MU_TX_CTRL_8730A, val32);

	/* Reset gid_valid table */
	rtw_write32(adapter, REG_MU_STA_GID_VLD_8730A, 0);
	rtw_write32(adapter, REG_MU_STA_USER_POS_INFO_8730A, user_position_l);
	rtw_write32(adapter, REG_MU_STA_USER_POS_INFO_8730A + 4, user_position_h);

	/* set validity of MU STAs */
	val32 = BIT_SET_MU_TAB_VALID_8730A(val32, info->beamformee_mu_reg_maping);
	rtw_write32(adapter, REG_MU_TX_CTRL_8730A, val32);

	RTW_INFO("%s: RegMUTxCtrl=0x%x, user_position_l=0x%x, user_position_h=0x%x\n",
		 __FUNCTION__, val32, user_position_l, user_position_h);

	val16 = rtw_read16(adapter, mu_reg[idx]);
	val16 &= 0xFE00; /* Clear PAID */
	val16 |= BIT(9); /* Enable MU BFee */
	val16 |= bfee->p_aid;
	rtw_write16(adapter, mu_reg[idx], val16);
	RTW_INFO("%s: Write mu_reg 0x%x = 0x%x\n",
		 __FUNCTION__, mu_reg[idx], val16);

	/* 0x42C[30] = 1 (0: from Tx desc, 1: from 0x45F) */
	val8 = rtw_read8(adapter, REG_TXBF_CTRL_8730A + 3);
	val8 |= 0xD0; /* Set bit 28, 30, 31 to 3b'111 */
	rtw_write8(adapter, REG_TXBF_CTRL_8730A + 3, val8);

	/* Set NDPA rate*/
	val8 = phydm_get_ndpa_rate(GET_PDM_ODM(adapter));
	rtw_write8(adapter, REG_NDPA_RATE_8730A, val8);

	val8 = rtw_read8(adapter, REG_NDPA_OPT_CTRL_8730A);
	val8 = BIT_SET_NDPA_BW_8730A(val8, 0); /* Clear bit 0, 1 */
	rtw_write8(adapter, REG_NDPA_OPT_CTRL_8730A, val8);

	val32 = rtw_read32(adapter, REG_SND_PTCL_CTRL_8730A);
	val32 = (val32 & 0xFF0000FF) | 0x020200; /* Set [23:8] to 0x0202 */
	rtw_write32(adapter, REG_SND_PTCL_CTRL_8730A, val32);

	/* Set 0x6A0[14] = 1 to accept action_no_ack */
	val8 = rtw_read8(adapter, REG_RXFLTMAP0_8730A + 1);
	val8 |= (BIT_MGTFLT14EN_8730A >> 8);
	rtw_write8(adapter, REG_RXFLTMAP0_8730A + 1, val8);

	/* 0x718[15] = 1. Patch for STA2 CSI report start offset error issue */
	val8 = rtw_read8(adapter, REG_SND_PTCL_CTRL_8730A + 1);
	val8 |= (BIT_VHTNDP_RPTPOLL_CSI_STR_OFFSET_SEL_8730A >> 8);
	rtw_write8(adapter, REG_SND_PTCL_CTRL_8730A + 1, val8);

	/* End of MAC registers setting */

	phydm_txbf_rfmode(GET_PDM_ODM(adapter), info->beamformee_su_cnt, info->beamformee_mu_cnt);

	/* <tynli_mark> <TODO> Need to set timer 2015.12.23 */
	/* Special for plugfest */
	rtw_mdelay_os(50); /* wait for 4-way handshake ending */
	rtw_bf_send_vht_gid_mgnt_packet(adapter, bfee->mac_addr, bfee->gid_valid, bfee->user_position);
}

static void _reset_beamformer_su(PADAPTER adapter, struct beamformer_entry *bfer)
{
	/* Beamforming */
	struct beamforming_info *info;
	u8 idx;


	info = GET_BEAMFORM_INFO(adapter);
	/* SU BFer */
	idx = bfer->su_reg_index;

	if (idx == 0) {
		rtw_write32(adapter, REG_ASSOCIATED_BFMER0_INFO_8730A, 0);
		rtw_write16(adapter, REG_ASSOCIATED_BFMER0_INFO_8730A + 4, 0);
		rtw_write16(adapter, REG_TX_CSI_RPT_PARAM_BW20_8730A, 0);
	} else {
		rtw_write32(adapter, REG_ASSOCIATED_BFMER1_INFO_8730A, 0);
		rtw_write16(adapter, REG_ASSOCIATED_BFMER1_INFO_8730A + 4, 0);
		rtw_write16(adapter, REG_TX_CSI_RPT_PARAM_BW20_8730A + 2, 0);
	}

	info->beamformer_su_reg_maping &= ~BIT(idx);
	bfer->su_reg_index = 0xFF;

	RTW_INFO("%s: Clear SU BFer entry(%d) HW setting\n", __FUNCTION__, idx);
}

static void _reset_beamformer_mu(PADAPTER adapter, struct beamformer_entry *bfer)
{
	struct beamforming_info *bf_info;

	bf_info = GET_BEAMFORM_INFO(adapter);

	rtw_halmac_bf_del_mu_bfer(adapter_to_dvobj(adapter));

	if (bf_info->beamformer_su_cnt == 0 &&
	    bf_info->beamformer_mu_cnt == 0) {
		rtw_halmac_bf_del_sounding(adapter_to_dvobj(adapter), HAL_BFEE);
	}

	RTW_INFO("%s: Clear MU BFer entry HW setting\n", __FUNCTION__);
}

static void _reset_beamformee_su(PADAPTER adapter, struct beamformee_entry *bfee)
{
	/* Beamforming */
	struct beamforming_info *info;
	u8 idx;
	/* Misc */
	u32 txbf_ctrl, bfmee_sel;


	info = GET_BEAMFORM_INFO(adapter);
	/* SU BFee */
	idx = bfee->su_reg_index;

	/* Force disable sounding config */
	_config_sounding(adapter, bfee, _FALSE, HW_CFG_SOUNDING_TYPE_LEAVE);

	/* clear P_AID */
	txbf_ctrl = rtw_read32(adapter, REG_TXBF_CTRL_8730A);
	bfmee_sel = rtw_read32(adapter, REG_ASSOCIATED_BFMEE_SEL_8730A);
	if (idx == 0) {
		txbf_ctrl = BIT_SET_TXBF0_AID_8730A(txbf_ctrl, 0);
		txbf_ctrl &= ~(BIT_TXBF0_20M_8730A | BIT_TXBF0_40M_8730A | BIT_TXBF0_80M_160M_8730A);

		bfmee_sel = BIT_SET_AID0_8730A(bfmee_sel, 0);
		bfmee_sel &= ~BIT_TXUSER_ID0_8730A;
	} else {
		txbf_ctrl = BIT_SET_TXBF1_AID_8730A(txbf_ctrl, 0);
		txbf_ctrl &= ~(BIT_TXBF1_20M_8730A | BIT_TXBF1_40M_8730A | BIT_TXBF1_80M_160M_8730A);

		bfmee_sel = BIT_SET_AID1_8730A(bfmee_sel, 0);
		bfmee_sel &= ~BIT_TXUSER_ID1_8730A;
	}
	txbf_ctrl |= BIT_EN_NDPA_INT_8730A | BIT_NDPA_PARA_8730A | BIT_ENABLE_NDPA_8730A;
	rtw_write32(adapter, REG_TXBF_CTRL_8730A, txbf_ctrl);
	rtw_write32(adapter, REG_ASSOCIATED_BFMEE_SEL_8730A, bfmee_sel);

	info->beamformee_su_reg_maping &= ~BIT(idx);
	bfee->su_reg_index = 0xFF;

	RTW_INFO("%s: Clear SU BFee entry(%d) HW setting\n", __FUNCTION__, idx);
}

static void _reset_beamformee_mu(PADAPTER adapter, struct beamformee_entry *bfee)
{
	/* Beamforming */
	struct beamforming_info *info;
	u8 idx;
	u32 mu_reg[6] = {REG_WMAC_ASSOCIATED_MU_BFMEE2_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE3_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE4_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE5_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE6_8730A,
			 REG_WMAC_ASSOCIATED_MU_BFMEE7_8730A
			};
	/* Misc */
	u32 val32;


	info = GET_BEAMFORM_INFO(adapter);
	/* MU BFee */
	idx = bfee->mu_reg_index;

	/* Disable sending NDPA & BF-rpt-poll to this BFee */
	rtw_write16(adapter, mu_reg[idx], 0);
	/* Set validity of MU STA */
	val32 = rtw_read32(adapter, REG_MU_TX_CTRL_8730A);
	val32 &= ~BIT(idx);
	rtw_write32(adapter, REG_MU_TX_CTRL_8730A, val32);

	/* Force disable sounding config */
	_config_sounding(adapter, bfee, _TRUE, HW_CFG_SOUNDING_TYPE_LEAVE);

	info->beamformee_mu_reg_maping &= ~BIT(idx);
	bfee->mu_reg_index = 0xFF;

	RTW_INFO("%s: Clear MU BFee entry(%d) HW setting\n", __FUNCTION__, idx);
}

void rtl8730a_phy_bf_reset_all(PADAPTER adapter)
{
	struct beamforming_info *info;
	u8 i, val8;
	u32 val32;


	RTW_INFO("+%s\n", __FUNCTION__);
	info = GET_BEAMFORM_INFO(adapter);

	info->bSetBFHwConfigInProgess = _TRUE;

