StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_phy.c
	/* Reset MU BFer entry setting */
	/* Clear validity of MU STA0 and MU STA1 */
	val32 = rtw_read32(adapter, REG_MU_TX_CTRL_8730A);
	val32 = BIT_SET_MU_TAB_VALID_8730A(val32, 0);
	rtw_write32(adapter, REG_MU_TX_CTRL_8730A, val32);

	/* Reset SU BFer entry setting */
	rtw_write32(adapter, REG_ASSOCIATED_BFMER0_INFO_8730A, 0);
	rtw_write16(adapter, REG_ASSOCIATED_BFMER0_INFO_8730A + 4, 0);
	rtw_write16(adapter, REG_TX_CSI_RPT_PARAM_BW20_8730A, 0);

	rtw_write32(adapter, REG_ASSOCIATED_BFMER1_INFO_8730A, 0);
	rtw_write16(adapter, REG_ASSOCIATED_BFMER1_INFO_8730A + 4, 0);
	rtw_write16(adapter, REG_TX_CSI_RPT_PARAM_BW20_8730A + 2, 0);

	/* Force disable sounding */
	_config_sounding(adapter, NULL, _FALSE, HW_CFG_SOUNDING_TYPE_RESET);

	/* Config RF mode */
	phydm_txbf_rfmode(GET_PDM_ODM(adapter), info->beamformee_su_cnt, info->beamformee_mu_cnt);

	/* Reset MU BFee entry setting */

	/* Disable sending NDPA & BF-rpt-poll to all BFee */
	for (i = 0; i < MAX_NUM_BEAMFORMEE_MU; i++) {
		rtw_write16(adapter, REG_WMAC_ASSOCIATED_MU_BFMEE2_8730A + (i * 2), 0);
	}

	/* set validity of MU STA */
	rtw_write32(adapter, REG_MU_TX_CTRL_8730A, 0);

	/* Reset SU BFee entry setting */
	/* SU BF0 and BF1 */
	val32 = BIT_EN_NDPA_INT_8730A | BIT_NDPA_PARA_8730A | BIT_ENABLE_NDPA_8730A;
	rtw_write32(adapter, REG_TXBF_CTRL_8730A, val32);
	rtw_write32(adapter, REG_ASSOCIATED_BFMEE_SEL_8730A, 0);

	info->bSetBFHwConfigInProgess = _FALSE;

#if 0
	/* Clear SU TxBF workaround BB registers */
	if (_TRUE == info->bEnableSUTxBFWorkAround) {
		rtl8730a_phy_bf_set_csi_report(adapter, &info->TargetCSIInfo);
	}
#endif

	RTW_INFO("-%s\n", __FUNCTION__);
}

void rtl8730a_phy_bf_init(PADAPTER adapter)
{
	u8 v8;
	u32 v32;

	v32 = rtw_read32(adapter, REG_MU_TX_CTRL_8730A);
	/* Enable P1 aggr new packet according to P0 transfer time */
	v32 |= BIT_MU_SECONDARY_WAITMODE_EN_8730A;
	/* MU Retry Limit */
	v32 = BIT_SET_MU_RL_8730A(v32, 0xA);
	/* Disable Tx MU-MIMO until sounding done */
	v32 &= ~BIT_MU_EN_8730A;
	/* Clear validity of MU STAs */
	v32 = BIT_SET_MU_TAB_VALID_8730A(v32, 0);
	rtw_write32(adapter, REG_MU_TX_CTRL_8730A, v32);

	/* MU-MIMO Option as default value */
	v8 = BIT_WMAC_TXMU_ACKPOLICY_8730A(3);
	v8 |= BIT_WMAC_TXMU_ACKPOLICY_EN_8730A;
	rtw_write8(adapter, REG_MU_BF_OPTION_8730A, v8);
	/* MU-MIMO Control as default value */
	rtw_write16(adapter, REG_WMAC_MU_BF_CTL_8730A, 0);

	/* Set MU NDPA rate & BW source */
	/* 0x42C[30] = 1 (0: from Tx desc, 1: from 0x45F) */
	v8 = rtw_read8(adapter, REG_TXBF_CTRL_8730A + 3);
	v8 |= (BIT_NDPA_PARA_8730A >> 24);
	rtw_write8(adapter, REG_TXBF_CTRL_8730A + 3, v8);
	/* 0x45F[7:0] = 0x10 (Rate=OFDM_6M, BW20) */
	rtw_write8(adapter, REG_NDPA_OPT_CTRL_8730A, 0x10);

	/* Temp Settings */
	/* STA2's CSI rate is fixed at 6M */
	v8 = rtw_read8(adapter, 0x6DF);
	v8 = (v8 & 0xC0) | 0x4;
	rtw_write8(adapter, 0x6DF, v8);
}

void rtl8730a_phy_bf_enter(PADAPTER adapter, struct sta_info *sta)
{
	struct beamforming_info *info;
	struct beamformer_entry *bfer;
	struct beamformee_entry *bfee;


	RTW_INFO("+%s: " MAC_FMT "\n", __FUNCTION__, MAC_ARG(sta->cmn.mac_addr));

	info = GET_BEAMFORM_INFO(adapter);
	bfer = rtw_bf_bfer_get_entry_by_addr(adapter, sta->cmn.mac_addr);
	bfee = rtw_bf_bfee_get_entry_by_addr(adapter, sta->cmn.mac_addr);

	info->bSetBFHwConfigInProgess = _TRUE;

	if (bfer) {
		bfer->state = BEAMFORM_ENTRY_HW_STATE_ADDING;

		if (TEST_FLAG(bfer->cap, BEAMFORMER_CAP_VHT_MU)) {
			_config_beamformer_mu(adapter, bfer);
		} else if (TEST_FLAG(bfer->cap, BEAMFORMER_CAP_VHT_SU | BEAMFORMER_CAP_HT_EXPLICIT)) {
			_config_beamformer_su(adapter, bfer);
		}

		bfer->state = BEAMFORM_ENTRY_HW_STATE_ADDED;
	}

	if (bfee) {
		bfee->state = BEAMFORM_ENTRY_HW_STATE_ADDING;

		if (TEST_FLAG(bfee->cap, BEAMFORMEE_CAP_VHT_MU)) {
			_config_beamformee_mu(adapter, bfee);
		} else if (TEST_FLAG(bfee->cap, BEAMFORMEE_CAP_VHT_SU | BEAMFORMEE_CAP_HT_EXPLICIT)) {
			_config_beamformee_su(adapter, bfee);
		}

		bfee->state = BEAMFORM_ENTRY_HW_STATE_ADDED;
	}

	info->bSetBFHwConfigInProgess = _FALSE;

	RTW_INFO("-%s\n", __FUNCTION__);
}

void rtl8730a_phy_bf_leave(PADAPTER adapter, u8 *addr)
{
	struct beamforming_info *info;
	struct beamformer_entry *bfer;
	struct beamformee_entry *bfee;


	RTW_INFO("+%s: " MAC_FMT "\n", __FUNCTION__, MAC_ARG(addr));

	info = GET_BEAMFORM_INFO(adapter);

	bfer = rtw_bf_bfer_get_entry_by_addr(adapter, addr);
	bfee = rtw_bf_bfee_get_entry_by_addr(adapter, addr);

	/* Clear P_AID of Beamformee */
	/* Clear MAC address of Beamformer */
	/* Clear Associated Bfmee Sel */
	if (bfer) {
		bfer->state = BEAMFORM_ENTRY_HW_STATE_DELETING;

		rtw_write8(adapter, REG_SND_PTCL_CTRL_8730A, 0xD8);

		if (TEST_FLAG(bfer->cap, BEAMFORMER_CAP_VHT_MU)) {
			_reset_beamformer_mu(adapter, bfer);
		} else if (TEST_FLAG(bfer->cap, BEAMFORMER_CAP_VHT_SU | BEAMFORMER_CAP_HT_EXPLICIT)) {
			_reset_beamformer_su(adapter, bfer);
		}

		bfer->state = BEAMFORM_ENTRY_HW_STATE_NONE;
		bfer->cap = BEAMFORMING_CAP_NONE;
		bfer->used = _FALSE;
	}

	if (bfee) {
		bfee->state = BEAMFORM_ENTRY_HW_STATE_DELETING;

		phydm_txbf_rfmode(GET_PDM_ODM(adapter), info->beamformee_su_cnt, info->beamformee_mu_cnt);

		if (TEST_FLAG(bfee->cap, BEAMFORMEE_CAP_VHT_MU)) {
			_reset_beamformee_mu(adapter, bfee);
		} else if (TEST_FLAG(bfee->cap, BEAMFORMEE_CAP_VHT_SU | BEAMFORMEE_CAP_HT_EXPLICIT)) {
			_reset_beamformee_su(adapter, bfee);
		}

		bfee->state = BEAMFORM_ENTRY_HW_STATE_NONE;
		bfee->cap = BEAMFORMING_CAP_NONE;
		bfee->used = _FALSE;
	}

	RTW_INFO("-%s\n", __FUNCTION__);
}

void rtl8730a_phy_bf_set_gid_table(PADAPTER adapter,
				   struct beamformer_entry	*bfer_info)
{
	struct beamformer_entry *bfer;
	struct beamforming_info *info;
	u32 gid_valid[2] = {0};
	u32 user_position[4] = {0};
	int i;

	/* update bfer info */
	bfer = rtw_bf_bfer_get_entry_by_addr(adapter, bfer_info->mac_addr);
	if (!bfer) {
		RTW_INFO("%s: Cannot find BFer entry!!\n", __func__);
		return;
	}
	_rtw_memcpy(bfer->gid_valid, bfer_info->gid_valid, 8);
	_rtw_memcpy(bfer->user_position, bfer_info->user_position, 16);

	info = GET_BEAMFORM_INFO(adapter);
	info->bSetBFHwConfigInProgess = _TRUE;

	/* For GID 0~31 */
	for (i = 0; i < 4; i++) {
		gid_valid[0] |= (bfer->gid_valid[i] << (i << 3));
	}

	for (i = 0; i < 8; i++) {
		if (i < 4) {
			user_position[0] |= (bfer->user_position[i] << (i << 3));
		} else {
			user_position[1] |= (bfer->user_position[i] << ((i - 4) << 3));
		}
	}

	RTW_INFO("%s: STA0: gid_valid=0x%x, user_position_l=0x%x, user_position_h=0x%x\n",
		 __func__, gid_valid[0], user_position[0], user_position[1]);

