StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_phy.c
	/* For GID 32~64 */
	for (i = 4; i < 8; i++) {
		gid_valid[1] |= (bfer->gid_valid[i] << ((i - 4) << 3));
	}

	for (i = 8; i < 16; i++) {
		if (i < 12) {
			user_position[2] |= (bfer->user_position[i] << ((i - 8) << 3));
		} else {
			user_position[3] |= (bfer->user_position[i] << ((i - 12) << 3));
		}
	}

	RTW_INFO("%s: STA1: gid_valid=0x%x, user_position_l=0x%x, user_position_h=0x%x\n",
		 __func__, gid_valid[1], user_position[2], user_position[3]);

	rtw_halmac_bf_cfg_mu_bfee(adapter_to_dvobj(adapter), gid_valid, user_position);

	info->bSetBFHwConfigInProgess = _FALSE;
}

#if 0
void rtl8730a_phy_bf_set_csi_report(PADAPTER adapter, struct _RT_CSI_INFO *csi)
{
	PHAL_DATA_TYPE hal;
	struct beamforming_info *info;
	BOOLEAN enable_su = FALSE;


	hal = GET_HAL_DATA(adapter);
	info = GET_BEAMFORM_INFO(adapter);

	info->bSetBFHwConfigInProgess = _TRUE;

	if (IS_A_CUT(hal->version_id) || IS_B_CUT(hal->version_id) || IS_C_CUT(hal->version_id)) {
		/* If there is an MU BFee added then discard the SU BFee supported capability */
		if ((info->beamformee_su_cnt > 0) && (info->beamformee_mu_cnt == 0)) {
			enable_su = TRUE;
		}

		phydm_8814b_sutxbfer_workaroud(
			GET_PDM_ODM(adapter),
			enable_su,
			csi->Nc,
			csi->Nr,
			csi->Ng,
			csi->CodeBook,
			csi->ChnlWidth,
			csi->bVHT);

		RTW_INFO("%s: bEnable=%d, Nc=%d, Nr=%d, CH_W=%d, Ng=%d, CodeBook=%d\n",
			 __FUNCTION__, bEnable,
			 csi->Nc, csi->Nr, csi->ChnlWidth, csi->Ng, csi->CodeBook);
	}

	info->bSetBFHwConfigInProgess = _FALSE;
}
#endif

void rtl8730a_phy_bf_sounding_status(PADAPTER adapter, u8 status)
{
	struct beamforming_info	*info;
	struct sounding_info *sounding;
	struct beamformee_entry *bfee;
	enum _HW_CFG_SOUNDING_TYPE sounding_type;
	u16 val16;
	u32 val32;
	u8 is_sounding_success[6] = {0};


	RTW_INFO("+%s\n", __FUNCTION__);

	info = GET_BEAMFORM_INFO(adapter);
	sounding = &info->sounding_info;

	info->bSetBFHwConfigInProgess = _TRUE;

	if (sounding->state == SOUNDING_STATE_SU_SOUNDDOWN) {
		/* SU sounding done */
		RTW_INFO("%s: SUBFeeCurIdx=%d\n", __FUNCTION__, sounding->su_bfee_curidx);

		bfee = &info->bfee_entry[sounding->su_bfee_curidx];
		if (bfee->bSoundingTimeout) {
			RTW_INFO("%s: Return because SUBFeeCurIdx(%d) is sounding timeout!!!\n", __FUNCTION__, sounding->su_bfee_curidx);
			info->bSetBFHwConfigInProgess = _FALSE;
			return;
		}

		RTW_INFO("%s: Config SU sound down HW settings\n", __FUNCTION__);
		/* Config SU sounding */
		if (_TRUE == status) {
			sounding_type = HW_CFG_SOUNDING_TYPE_SOUNDDOWN;
		} else {
			sounding_type = HW_CFG_SOUNDING_TYPE_LEAVE;
		}
		_config_sounding(adapter, bfee, _FALSE, sounding_type);

		/* <tynli_note> Why set here? */
		/* disable NDP packet use beamforming */
		val16 = rtw_read16(adapter, REG_TXBF_CTRL_8730A);
		val16 |= BIT_DIS_NDP_BFEN_8730A;
		rtw_write16(adapter, REG_TXBF_CTRL_8730A, val16);
	} else if (sounding->state == SOUNDING_STATE_MU_SOUNDDOWN) {
		/* MU sounding done */
		RTW_INFO("%s: Config MU sound down HW settings\n", __FUNCTION__);

		val32 = rtw_read32(adapter, REG_WMAC_ASSOCIATED_MU_BFMEE2_8730A);
		is_sounding_success[0] = (val32 & BIT_STATUS_BFEE2_8730A) ? 1 : 0;
		is_sounding_success[1] = ((val32 >> 16) & BIT_STATUS_BFEE3_8730A) ? 1 : 0;
		val32 = rtw_read32(adapter, REG_WMAC_ASSOCIATED_MU_BFMEE4_8730A);
		is_sounding_success[2] = (val32 & BIT_STATUS_BFEE4_8730A) ? 1 : 0;
		is_sounding_success[3] = ((val32 >> 16) & BIT_BIT_STATUS_BFEE5_8730A) ? 1 : 0;
		val32 = rtw_read32(adapter, REG_WMAC_ASSOCIATED_MU_BFMEE6_8730A);
		is_sounding_success[4] = (val32 & BIT_STATUS_BFEE6_8730A) ? 1 : 0;
		is_sounding_success[5] = ((val32 >> 16) & BIT_STATUS_BFEE7_8730A) ? 1 : 0;

		RTW_INFO("%s: is_sounding_success STA1:%d, STA2:%d, STA3:%d, STA4:%d, STA5:%d, STA6:%d\n",
			 __FUNCTION__, is_sounding_success[0], is_sounding_success[1], is_sounding_success[2],
			 is_sounding_success[3], is_sounding_success[4], is_sounding_success[5]);

		/* Config MU sounding */
		_config_sounding(adapter, NULL, _TRUE, HW_CFG_SOUNDING_TYPE_SOUNDDOWN);
	} else {
		RTW_INFO("%s: Invalid sounding state(%d). Do nothing!\n", __FUNCTION__, sounding->state);
	}

	info->bSetBFHwConfigInProgess = _FALSE;

	RTW_INFO("-%s\n", __FUNCTION__);
}
#endif /* CONFIG_BEAMFORMING */

#ifdef CONFIG_LPS_PWR_TRACKING
void rtw_lps_pwr_tracking(_adapter *adapter, u8 thermal_value)
{
#ifdef CONFIG_LPS
	u8 lps_changed;

	if (adapter_to_pwrctl(adapter)->bLeisurePs &&
	    adapter_to_pwrctl(adapter)->bFwCurrentInPSMode &&
	    adapter_to_pwrctl(adapter)->pwr_mode != PS_MODE_ACTIVE) {
		lps_changed = _TRUE;
		LPS_Leave(adapter, "LPS_CTRL_TXSS");
	}

	rtw_phydm_pwr_tracking_directly(adapter);

	if (lps_changed) {
		LPS_Enter(adapter, "LPS_CTRL_TXSS");
	}
#endif

	thermal_value += THERMAL_DIFF_TH;
	rtl8730a_set_fw_thermal_rpt_cmd(adapter, _TRUE, thermal_value);
}
#endif

